jobapp/app/controllers/skills_controller.rb

  def index
    @skills = Skill.all
---
SELECT "skills".* FROM "skills"

  def create
    @skill = Skill.new(skill_params)

    respond_to do |format|
      if @skill.save
---
INSERT INTO "skills" ("skill_category_id", "name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["skill_category_id", 1], ["name", "Hi"], ["description", "Hello there"], ["created_at", 2016-09-03 02:09:49 UTC], ["updated_at", 2016-09-03 02:09:49 UTC]]

    def set_skill
      @skill = Skill.find(params[:id])
---
SELECT  "skills".* FROM "skills" WHERE "skills"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]