jobapp/app/controllers/student_profiles_controller.rb

SELECT "student_profiles".* FROM "student_profiles"
---
  def index
    @student_profiles = StudentProfile.all

INSERT INTO "student_profiles" ("first_name", "last_name", "phone", "bio", "website", "github_username", "linkedin_url", "photo", "cv", "city", "country", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @student_profile = StudentProfile.new(student_profile_params)

    respond_to do |format|
      if @student_profile.save

SELECT  "student_profiles".* FROM "student_profiles" WHERE "student_profiles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_student_profile
      @student_profile = StudentProfile.find(params[:id])